zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pdma_reg.h
     * |        |          |This controls the period of time-out function for channel 2
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC3      |Time-out Counter for Channel 3
     * |        |          |This controls the period of time-out function for channel 3
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC4_5
     * Offset: 0x448  PDMA Time-out Counter Ch4 and Ch5 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC4      |Time-out Counter for Channel 4
     * |        |          |This controls the period of time-out function for channel 4
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC5      |Time-out Counter for Channel 5
     * |        |          |This controls the period of time-out function for channel 5
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC6_7
     * Offset: 0x44C  PDMA Time-out Counter Ch6 and Ch7 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC6      |Time-out Counter for Channel 6
     * |        |          |This controls the period of time-out function for channel 6
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC7      |Time-out Counter for Channel 7
     * |        |          |This controls the period of time-out function for channel 7
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC8_9
     * Offset: 0x450  PDMA Time-out Counter Ch8 and Ch9 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC8      |Time-out Counter for Channel 8
     * |        |          |This controls the period of time-out function for channel 8
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC9      |Time-out Counter for Channel 9
     * |        |          |This controls the period of time-out function for channel 9
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC10_11
     * Offset: 0x454  PDMA Time-out Counter Ch10 and Ch11 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC10     |Time-out Counter for Channel 10
     * |        |          |This controls the period of time-out function for channel 10
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC11     |Time-out Counter for Channel 11
     * |        |          |This controls the period of time-out function for channel 11
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC12_13
     * Offset: 0x458  PDMA Time-out Counter Ch12 and Ch13 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC12     |Time-out Counter for Channel 12
     * |        |          |This controls the period of time-out function for channel 12
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC13     |Time-out Counter for Channel 13
     * |        |          |This controls the period of time-out function for channel 13
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::TOC14_15
     * Offset: 0x45C  PDMA Time-out Counter Ch14 and Ch15 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TOC14     |Time-out Counter for Channel 14
     * |        |          |This controls the period of time-out function for channel 14
     * |        |          |The calculation unit is based on 10 kHz clock.
     * |[31:16] |TOC15     |Time-out Counter for Channel 15
     * |        |          |This controls the period of time-out function for channel 15
     * |        |          |The calculation unit is based on 10 kHz clock.
     * @var PDMA_T::CHRST
     * Offset: 0x460  PDMA Channel Reset Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CHnRST    |Channel N Reset
     * |        |          |0 = corresponding channel n not reset.
     * |        |          |1 = corresponding channel n is reset.
     * @var PDMA_T::TOUTPSC8_15
     * Offset: 0x468  PDMA Time-out Prescaler Register(CH8 to CH15)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TOUTPSC8  |PDMA Channel 8 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 8 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 8 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 8 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 8 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 8 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 8 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 8 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 8 time-out clock source is HCLK/215.
     * |[6:4]   |TOUTPSC9  |PDMA Channel 9 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 9 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 9 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 9 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 9 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 9 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 9 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 9 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 9 time-out clock source is HCLK/215.
     * |[10:8]  |TOUTPSC10 |PDMA Channel 10 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 10 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 10 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 10 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 10 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 10 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 10 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 10 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 10 time-out clock source is HCLK/215.
     * |[14:12] |TOUTPSC11 |PDMA Channel 11 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 11 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 11 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 11 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 11 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 11 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 11 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 11 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 11 time-out clock source is HCLK/215.
     * |[18:16] |TOUTPSC12 |PDMA Channel 12 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 12 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 12 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 12 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 12 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 12 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 12 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 12 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 12 time-out clock source is HCLK/215.
     * |[22:20] |TOUTPSC13 |PDMA Channel 13 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 13 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 13 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 13 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 13 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 13 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 13 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 13 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 13 time-out clock source is HCLK/215.
     * |[26:24] |TOUTPSC14 |PDMA Channel 14 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 14 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 14 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 14 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 14 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 14 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 14 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 14 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 14 time-out clock source is HCLK/215.
     * |[30:28] |TOUTPSC15 |PDMA Channel 15 Time-out Clock Source Prescaler Bits
     * |        |          |000 = PDMA channel 15 time-out clock source is HCLK/28.
     * |        |          |001 = PDMA channel 15 time-out clock source is HCLK/29.
     * |        |          |010 = PDMA channel 15 time-out clock source is HCLK/210.
     * |        |          |011 = PDMA channel 15 time-out clock source is HCLK/211.
     * |        |          |100 = PDMA channel 15 time-out clock source is HCLK/212.
     * |        |          |101 = PDMA channel 15 time-out clock source is HCLK/213.
     * |        |          |110 = PDMA channel 15 time-out clock source is HCLK/214.
     * |        |          |111 = PDMA channel 15 time-out clock source is HCLK/215.
     * @var PDMA_T::REQSEL0_3
     * Offset: 0x480  PDMA Request Source Select Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |REQSRC0   |Channel 0 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 0
     * |        |          |User can configure the peripheral by setting REQSRC0.
     * |        |          |0 = Disable PDMA peripheral request.
     * |        |          |1 = Reserved.
     * |        |          |2 = Channel connects to USB_TX.
     * |        |          |3 = Channel connects to USB_RX.
     * |        |          |4 = Channel connects to UART0_TX.
     * |        |          |5 = Channel connects to UART0_RX.
     * |        |          |6 = Channel connects to UART1_TX.
     * |        |          |7 = Channel connects to UART1_RX.
     * |        |          |8 = Channel connects to UART2_TX.
     * |        |          |9 = Channel connects to UART2_RX.
     * |        |          |10 = Channel connects to UART3_TX.
     * |        |          |11 = Channel connects to UART3_RX.
     * |        |          |12 = Channel connects to UART4_TX.
     * |        |          |13 = Channel connects to UART4_RX.
     * |        |          |14 = Channel connects to UART5_TX.
     * |        |          |15 = Channel connects to UART5_RX.
     * |        |          |16 = Channel connects to UART6_TX.
     * |        |          |17 = Channel connects to UART6_RX.
     * |        |          |18 = Channel connects to UART9_TX.
     * |        |          |19 = Channel connects to UART9_RX.
     * |        |          |20 = Channel connects to UART8_TX.
     * |        |          |21 = Channel connects to UART8_RX.
     * |        |          |22 = Channel connects to UART9_TX.
     * |        |          |23 = Channel connects to UART9_RX.
     * |        |          |24 = Channel connects to USCI0_TX.
     * |        |          |25 = Channel connects to USCI0_RX.
     * |        |          |26 = Channel connects to QSPI0_TX.
     * |        |          |27 = Channel connects to QSPI0_RX.
     * |        |          |28 = Channel connects to QSPI1_TX.
     * |        |          |29 = Channel connects to QSPI1_RX.
     * |        |          |30 = Channel connects to SPI0_TX.
     * |        |          |31 = Channel connects to SPI0_RX.
     * |        |          |32 = Channel connects to SPI1_TX.
     * |        |          |33 = Channel connects to SPI1_RX.
     * |        |          |34 = Channel connects to SPI2_TX.
     * |        |          |35 = Channel connects to SPI2_RX.
     * |        |          |36 = Channel connects to SPI3_TX.
     * |        |          |37 = Channel connects to SPI3_RX.
     * |        |          |38 = Channel connects to ACMP0.
     * |        |          |39 = Channel connects to ACMP1.
     * |        |          |40 = Channel connects to ACMP2.
     * |        |          |41 = Channel connects to ACMP3.
     * |        |          |42 = Channel connects to EPWM0_P1_RX.
     * |        |          |43 = Channel connects to EPWM0_P2_RX.
     * |        |          |44 = Channel connects to EPWM0_P3_RX.
     * |        |          |45 = Channel connects to EPWM1_P1_RX.
     * |        |          |46 = Channel connects to EPWM1_P2_RX.
     * |        |          |47 = Channel connects to EPWM1_P3_RX.
     * |        |          |48 = Channel connects to I2C0_TX.
     * |        |          |49 = Channel connects to I2C0_RX.
     * |        |          |50 = Channel connects to I2C1_TX.
     * |        |          |51 = Channel connects to I2C1_RX.
     * |        |          |52 = Channel connects to I2C2_TX.
     * |        |          |53 = Channel connects to I2C2_RX.
     * |        |          |54 = Channel connects to I2C3_TX.
     * |        |          |55 = Channel connects to I2C3_RX.
     * |        |          |56 = Channel connects to I2S0_TX.
     * |        |          |57 = Channel connects to I2S0_RX.
     * |        |          |58 = Channel connects to I2S1_TX.
     * |        |          |59 = Channel connects to I2S2_RX.
     * |        |          |60 = Channel connects to TMR0.
     * |        |          |61 = Channel connects to TMR1.
     * |        |          |62 = Channel connects to TMR2.
     * |        |          |63 = Channel connects to TMR3.
     * |        |          |64 = Channel connects to EDAC0_RX.
     * |        |          |65 = Channel connects to EDAC1_RX.
     * |        |          |66 = Channel connects to DAC0_TX.
     * |        |          |67 = Channel connects to DAC1_TX.
     * |        |          |68 = Channel connects to EPWM0_CH0_TX.
     * |        |          |69 = Channel connects to EPWM0_CH1_TX.
     * |        |          |70 = Channel connects to EPWM0_CH2_TX.
     * |        |          |71 = Channel connects to EPWM0_CH3_TX.
     * |        |          |72 = Channel connects to EPWM0_CH4_TX.
     * |        |          |73 = Channel connects to EPWM0_CH5_TX.
     * |        |          |74 = Channel connects to EPWM1_CH0_TX.
     * |        |          |75 = Channel connects to EPWM1_CH1_TX.
     * |        |          |76 = Channel connects to EPWM1_CH2_TX.
     * |        |          |77 = Channel connects to EPWM1_CH3_TX.
     * |        |          |78 = Channel connects to EPWM1_CH4_TX.
     * |        |          |79 = Channel connects to EPWM1_CH5_TX.
     * |        |          |80 = Channel connects to EINT0.
     * |        |          |81 = Channel connects to EINT1.
     * |        |          |82 = Channel connects to EINT2.
     * |        |          |83 = Channel connects to EINT3.
     * |        |          |84 = Channel connects to EINT4.
     * |        |          |85 = Channel connects to EINT5.
     * |        |          |86 = Channel connects to EINT6.
     * |        |          |87 = Channel connects to EINT7.
     * |        |          |88 = Reserved.
     * |        |          |89 = Reserved.
     * |        |          |90 = Channel connects to PSIO_TX.
     * |        |          |91 = Channel connects to PSIO_RX.
     * |        |          |92 = Channel connects to I3C0_TX.
     * |        |          |93 = Channel connects to I3C0_RX.
     * |        |          |94 = Channel connects to ETMC_RX.
     * |        |          |95 = Channel connects to SWODEC.
     * |        |          |Others = Reserved.
     * |        |          |Note 1: A peripheral can't assign to two channels at the same time.
     * |        |          |Note 2: This field is useless when transfer between memory and memory.
     * |[14:8]  |REQSRC1   |Channel 1 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 1
     * |        |          |User can configure the peripheral setting by REQSRC1.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[22:16] |REQSRC2   |Channel 2 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 2
     * |        |          |User can configure the peripheral setting by REQSRC2.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[30:24] |REQSRC3   |Channel 3 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 3
     * |        |          |User can configure the peripheral setting by REQSRC3.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * @var PDMA_T::REQSEL4_7
     * Offset: 0x484  PDMA Request Source Select Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |REQSRC4   |Channel 4 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 4
     * |        |          |User can configure the peripheral setting by REQSRC4.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[14:8]  |REQSRC5   |Channel 5 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 5
     * |        |          |User can configure the peripheral setting by REQSRC5.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[22:16] |REQSRC6   |Channel 6 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 6
     * |        |          |User can configure the peripheral setting by REQSRC6.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[30:24] |REQSRC7   |Channel 7 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 7
     * |        |          |User can configure the peripheral setting by REQSRC7.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * @var PDMA_T::REQSEL8_11
     * Offset: 0x488  PDMA Request Source Select Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |REQSRC8   |Channel 8 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 8
     * |        |          |User can configure the peripheral setting by REQSRC8.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[14:8]  |REQSRC9   |Channel 9 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 9
     * |        |          |User can configure the peripheral setting by REQSRC9.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[22:16] |REQSRC10  |Channel 10 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 10
     * |        |          |User can configure the peripheral setting by REQSRC10.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[30:24] |REQSRC11  |Channel 11 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 11
     * |        |          |User can configure the peripheral setting by REQSRC11.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * @var PDMA_T::REQSEL12_15
     * Offset: 0x48C  PDMA Request Source Select Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |REQSRC12  |Channel 12 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 12
     * |        |          |User can configure the peripheral setting by REQSRC12.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[14:8]  |REQSRC13  |Channel 13 Request Source Selection
