zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pdma_reg.h
#define PDMA_TOUTEN_TOUTEN1_Pos          (1)                                               /*!< PDMA_T::TOUTEN: TOUTEN1 Position      */
#define PDMA_TOUTEN_TOUTEN1_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN1_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN1 Mask          */

#define PDMA_TOUTEN_TOUTEN2_Pos          (2)                                               /*!< PDMA_T::TOUTEN: TOUTEN2 Position      */
#define PDMA_TOUTEN_TOUTEN2_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN2_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN2 Mask          */

#define PDMA_TOUTEN_TOUTEN3_Pos          (3)                                               /*!< PDMA_T::TOUTEN: TOUTEN3 Position      */
#define PDMA_TOUTEN_TOUTEN3_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN3_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN3 Mask          */

#define PDMA_TOUTEN_TOUTEN4_Pos          (4)                                               /*!< PDMA_T::TOUTEN: TOUTEN4 Position      */
#define PDMA_TOUTEN_TOUTEN4_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN4_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN4 Mask          */

#define PDMA_TOUTEN_TOUTEN5_Pos          (5)                                               /*!< PDMA_T::TOUTEN: TOUTEN5 Position      */
#define PDMA_TOUTEN_TOUTEN5_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN5_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN5 Mask          */

#define PDMA_TOUTEN_TOUTEN6_Pos          (6)                                               /*!< PDMA_T::TOUTEN: TOUTEN6 Position      */
#define PDMA_TOUTEN_TOUTEN6_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN6_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN6 Mask          */

#define PDMA_TOUTEN_TOUTEN7_Pos          (7)                                               /*!< PDMA_T::TOUTEN: TOUTEN7 Position      */
#define PDMA_TOUTEN_TOUTEN7_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN7_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN7 Mask          */

#define PDMA_TOUTEN_TOUTEN8_Pos          (8)                                               /*!< PDMA_T::TOUTEN: TOUTEN8 Position      */
#define PDMA_TOUTEN_TOUTEN8_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN8_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN8 Mask          */

#define PDMA_TOUTEN_TOUTEN9_Pos          (9)                                               /*!< PDMA_T::TOUTEN: TOUTEN9 Position      */
#define PDMA_TOUTEN_TOUTEN9_Msk          (0x1ul << PDMA_TOUTEN_TOUTEN9_Pos)                /*!< PDMA_T::TOUTEN: TOUTEN9 Mask          */

#define PDMA_TOUTEN_TOUTEN10_Pos         (10)                                              /*!< PDMA_T::TOUTEN: TOUTEN10 Position     */
#define PDMA_TOUTEN_TOUTEN10_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN10_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN10 Mask         */

#define PDMA_TOUTEN_TOUTEN11_Pos         (11)                                              /*!< PDMA_T::TOUTEN: TOUTEN11 Position     */
#define PDMA_TOUTEN_TOUTEN11_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN11_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN11 Mask         */

#define PDMA_TOUTEN_TOUTEN12_Pos         (12)                                              /*!< PDMA_T::TOUTEN: TOUTEN12 Position     */
#define PDMA_TOUTEN_TOUTEN12_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN12_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN12 Mask         */

#define PDMA_TOUTEN_TOUTEN13_Pos         (13)                                              /*!< PDMA_T::TOUTEN: TOUTEN13 Position     */
#define PDMA_TOUTEN_TOUTEN13_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN13_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN13 Mask         */

#define PDMA_TOUTEN_TOUTEN14_Pos         (14)                                              /*!< PDMA_T::TOUTEN: TOUTEN14 Position     */
#define PDMA_TOUTEN_TOUTEN14_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN14_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN14 Mask         */

#define PDMA_TOUTEN_TOUTEN15_Pos         (15)                                              /*!< PDMA_T::TOUTEN: TOUTEN15 Position     */
#define PDMA_TOUTEN_TOUTEN15_Msk         (0x1ul << PDMA_TOUTEN_TOUTEN15_Pos)               /*!< PDMA_T::TOUTEN: TOUTEN15 Mask         */

#define PDMA_TOUTIEN_TOUTIENn_Pos        (0)                                               /*!< PDMA_T::TOUTIEN: TOUTIENn Position    */
#define PDMA_TOUTIEN_TOUTIENn_Msk        (0xfffful << PDMA_TOUTIEN_TOUTIENn_Pos)           /*!< PDMA_T::TOUTIEN: TOUTIENn Mask        */

#define PDMA_TOUTIEN_TOUTIEN0_Pos        (0)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN0 Position    */
#define PDMA_TOUTIEN_TOUTIEN0_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN0_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN0 Mask        */

#define PDMA_TOUTIEN_TOUTIEN1_Pos        (1)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN1 Position    */
#define PDMA_TOUTIEN_TOUTIEN1_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN1_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN1 Mask        */

#define PDMA_TOUTIEN_TOUTIEN2_Pos        (2)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN2 Position    */
#define PDMA_TOUTIEN_TOUTIEN2_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN2_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN2 Mask        */

#define PDMA_TOUTIEN_TOUTIEN3_Pos        (3)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN3 Position    */
#define PDMA_TOUTIEN_TOUTIEN3_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN3_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN3 Mask        */

#define PDMA_TOUTIEN_TOUTIEN4_Pos        (4)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN4 Position    */
#define PDMA_TOUTIEN_TOUTIEN4_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN4_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN4 Mask        */

#define PDMA_TOUTIEN_TOUTIEN5_Pos        (5)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN5 Position    */
#define PDMA_TOUTIEN_TOUTIEN5_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN5_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN5 Mask        */

#define PDMA_TOUTIEN_TOUTIEN6_Pos        (6)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN6 Position    */
#define PDMA_TOUTIEN_TOUTIEN6_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN6_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN6 Mask        */

#define PDMA_TOUTIEN_TOUTIEN7_Pos        (7)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN7 Position    */
#define PDMA_TOUTIEN_TOUTIEN7_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN7_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN7 Mask        */

#define PDMA_TOUTIEN_TOUTIEN8_Pos        (8)                                               /*!< PDMA_T::TOUTIEN: TOUTIEN8 Position    */
#define PDMA_TOUTIEN_TOUTIEN8_Msk        (0x1ul << PDMA_TOUTIEN_TOUTIEN8_Pos)              /*!< PDMA_T::TOUTIEN: TOUTIEN8 Mask        */

