zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pdma_reg.h
#define PDMA_CHRST_CH12RST_Pos           (12)                                              /*!< PDMA_T::CHRST: CH12RST Position       */
#define PDMA_CHRST_CH12RST_Msk           (0x1ul << PDMA_CHRST_CH12RST_Pos)                 /*!< PDMA_T::CHRST: CH12RST Mask           */

#define PDMA_CHRST_CH13RST_Pos           (13)                                              /*!< PDMA_T::CHRST: CH13RST Position       */
#define PDMA_CHRST_CH13RST_Msk           (0x1ul << PDMA_CHRST_CH13RST_Pos)                 /*!< PDMA_T::CHRST: CH13RST Mask           */

#define PDMA_CHRST_CH14RST_Pos           (14)                                              /*!< PDMA_T::CHRST: CH14RST Position       */
#define PDMA_CHRST_CH14RST_Msk           (0x1ul << PDMA_CHRST_CH14RST_Pos)                 /*!< PDMA_T::CHRST: CH14RST Mask           */

#define PDMA_CHRST_CH15RST_Pos           (15)                                              /*!< PDMA_T::CHRST: CH15RST Position       */
#define PDMA_CHRST_CH15RST_Msk           (0x1ul << PDMA_CHRST_CH15RST_Pos)                 /*!< PDMA_T::CHRST: CH15RST Mask           */

#define PDMA_TOUTPSC8_15_TOUTPSC8_Pos    (0)                                               /*!< PDMA_T::TOUTPSC8_15: TOUTPSC8 Position  */
#define PDMA_TOUTPSC8_15_TOUTPSC8_Msk    (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC8_Pos)          /*!< PDMA_T::TOUTPSC8_15: TOUTPSC8 Mask      */

#define PDMA_TOUTPSC8_15_TOUTPSC9_Pos    (4)                                               /*!< PDMA_T::TOUTPSC8_15: TOUTPSC9 Position  */
#define PDMA_TOUTPSC8_15_TOUTPSC9_Msk    (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC9_Pos)          /*!< PDMA_T::TOUTPSC8_15: TOUTPSC9 Mask      */

#define PDMA_TOUTPSC8_15_TOUTPSC10_Pos   (8)                                               /*!< PDMA_T::TOUTPSC8_15: TOUTPSC10 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC10_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC10_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC10 Mask     */

#define PDMA_TOUTPSC8_15_TOUTPSC11_Pos   (12)                                              /*!< PDMA_T::TOUTPSC8_15: TOUTPSC11 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC11_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC11_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC11 Mask     */

#define PDMA_TOUTPSC8_15_TOUTPSC12_Pos   (16)                                              /*!< PDMA_T::TOUTPSC8_15: TOUTPSC12 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC12_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC12_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC12 Mask     */

#define PDMA_TOUTPSC8_15_TOUTPSC13_Pos   (20)                                              /*!< PDMA_T::TOUTPSC8_15: TOUTPSC13 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC13_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC13_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC13 Mask     */

#define PDMA_TOUTPSC8_15_TOUTPSC14_Pos   (24)                                              /*!< PDMA_T::TOUTPSC8_15: TOUTPSC14 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC14_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC14_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC14 Mask     */

#define PDMA_TOUTPSC8_15_TOUTPSC15_Pos   (28)                                              /*!< PDMA_T::TOUTPSC8_15: TOUTPSC15 Position */
#define PDMA_TOUTPSC8_15_TOUTPSC15_Msk   (0x7ul << PDMA_TOUTPSC8_15_TOUTPSC15_Pos)         /*!< PDMA_T::TOUTPSC8_15: TOUTPSC15 Mask     */

#define PDMA_REQSEL0_3_REQSRC0_Pos       (0)                                               /*!< PDMA_T::REQSEL0_3: REQSRC0 Position     */
#define PDMA_REQSEL0_3_REQSRC0_Msk       (0x7ful << PDMA_REQSEL0_3_REQSRC0_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC0 Mask         */

#define PDMA_REQSEL0_3_REQSRC1_Pos       (8)                                               /*!< PDMA_T::REQSEL0_3: REQSRC1 Position    */
#define PDMA_REQSEL0_3_REQSRC1_Msk       (0x7ful << PDMA_REQSEL0_3_REQSRC1_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC1 Mask        */

#define PDMA_REQSEL0_3_REQSRC2_Pos       (16)                                              /*!< PDMA_T::REQSEL0_3: REQSRC2 Position    */
#define PDMA_REQSEL0_3_REQSRC2_Msk       (0x7ful << PDMA_REQSEL0_3_REQSRC2_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC2 Mask        */

#define PDMA_REQSEL0_3_REQSRC3_Pos       (24)                                              /*!< PDMA_T::REQSEL0_3: REQSRC3 Position    */
#define PDMA_REQSEL0_3_REQSRC3_Msk       (0x7ful << PDMA_REQSEL0_3_REQSRC3_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC3 Mask        */

#define PDMA_REQSEL4_7_REQSRC4_Pos       (0)                                               /*!< PDMA_T::REQSEL4_7: REQSRC4 Position    */
#define PDMA_REQSEL4_7_REQSRC4_Msk       (0x7ful << PDMA_REQSEL4_7_REQSRC4_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC4 Mask        */

#define PDMA_REQSEL4_7_REQSRC5_Pos       (8)                                               /*!< PDMA_T::REQSEL4_7: REQSRC5 Position    */
#define PDMA_REQSEL4_7_REQSRC5_Msk       (0x7ful << PDMA_REQSEL4_7_REQSRC5_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC5 Mask        */

#define PDMA_REQSEL4_7_REQSRC6_Pos       (16)                                              /*!< PDMA_T::REQSEL4_7: REQSRC6 Position    */
#define PDMA_REQSEL4_7_REQSRC6_Msk       (0x7ful << PDMA_REQSEL4_7_REQSRC6_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC6 Mask        */

#define PDMA_REQSEL4_7_REQSRC7_Pos       (24)                                              /*!< PDMA_T::REQSEL4_7: REQSRC7 Position    */
#define PDMA_REQSEL4_7_REQSRC7_Msk       (0x7ful << PDMA_REQSEL4_7_REQSRC7_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC7 Mask        */

#define PDMA_REQSEL8_11_REQSRC8_Pos      (0)                                               /*!< PDMA_T::REQSEL8_11: REQSRC8 Position   */
#define PDMA_REQSEL8_11_REQSRC8_Msk      (0x7ful << PDMA_REQSEL8_11_REQSRC8_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC8 Mask       */

#define PDMA_REQSEL8_11_REQSRC9_Pos      (8)                                               /*!< PDMA_T::REQSEL8_11: REQSRC9 Position   */
#define PDMA_REQSEL8_11_REQSRC9_Msk      (0x7ful << PDMA_REQSEL8_11_REQSRC9_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC9 Mask       */

